In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(r"C:\Users\bunyo\OneDrive\Desktop\AI_Course\ModularProgramProjects\first_week_project\web_scraping\scraped_data.csv")

In [4]:
df

,Rank,Score,Name,Location,Acedemik Reputation,Students,Citations_per_faculty,faculty_student_ratio,employer_reputation,employment_outcomes,international_faculty_ratio,sustainability_score,international_research_network
0,1,100.0,Massachusetts Institute of Technology (MIT),United States,100.0,91.6,100.0,100.0,100.0,100.0,100.0,93.8,94.1
1,2,99.4,Imperial College London,United Kingdom,99.6,100.0,95.0,99.3,100.0,95.9,100.0,98.3,97.5
2,3,98.9,Stanford University,United States,100.0,73.5,99.7,100.0,100.0,100.0,94.2,95.4,96.5
3,4,97.9,University of Oxford,United Kingdom,100.0,98.6,91.0,100.0,100.0,100.0,98.8,77.9,100.0
4,5,97.7,Harvard University,United States,100.0,81.4,100.0,98.3,100.0,100.0,79.1,77.8,99.4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1345,\n 1001-1200\n ...,NaN,Warsaw University of Life Sciences SGGW (WULS...,Poland,8.0,11.9,14.6,23.1,7.9,7.1,2.4,42.6,67.5
1346,\n 1001-1200\n ...,NaN,West Virginia University,United States,6.4,8.8,28.4,15.0,7.5,21.4,8.3,44.6,66.9
1347,\n 1001-1200\n ...,NaN,Xi'an Jiaotong Liverpool University,China (Mainland),5.9,5.2,12.0,8.1,5.4,1.3,95.2,44.0,45.9
1348,\n 1001-1200\n ...,NaN,Yerevan State University,Armenia,8.7,3.0,1.9,64.8,6.0,90.0,8.7,13.3,21.2
1349,\n 1001-1200\n ...,NaN,Yokohama City University,Japan,3.3,6.0,19.0,96.7,3.7,3.5,7.2,14.5,15.0

df da Score qiymati qayerdan boshlab Nan bolishni boshlaganini korish
855 chi index dan boshlab Nan boshlangan ekan

In [5]:
inx = df[df['Score'].isnull()].index[0]
df.iloc[inx-3::]

,Rank,Score,Name,Location,Acedemik Reputation,Students,Citations_per_faculty,faculty_student_ratio,employer_reputation,employment_outcomes,international_faculty_ratio,sustainability_score,international_research_network
852,\n =697\n ...,25.1,Universidad de Alcalá (Madrid),Spain,13.8,50.9,10.8,72.5,10.2,11.8,11.8,72.1,79.4
853,\n =697\n ...,25.1,University of Klagenfurt,Austria,7.2,94.8,16.4,57.4,5.8,13.6,98.2,36.3,43.9
854,\n =697\n ...,25.1,"University of Missouri, Columbia",United States,17.2,6.4,23.5,38.5,15.7,48.0,29.7,50.9,71.8
855,\n 701-710\n ...,NaN,Jeonbuk National University,South Korea,19.9,16.5,21.4,73.7,14.2,3.5,12.5,64.6,34.0
856,\n 701-710\n ...,NaN,Kasetsart University,Thailand,37.4,1.7,4.6,10.3,37.1,31.2,7.7,60.8,46.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1345,\n 1001-1200\n ...,NaN,Warsaw University of Life Sciences SGGW (WULS...,Poland,8.0,11.9,14.6,23.1,7.9,7.1,2.4,42.6,67.5
1346,\n 1001-1200\n ...,NaN,West Virginia University,United States,6.4,8.8,28.4,15.0,7.5,21.4,8.3,44.6,66.9
1347,\n 1001-1200\n ...,NaN,Xi'an Jiaotong Liverpool University,China (Mainland),5.9,5.2,12.0,8.1,5.4,1.3,95.2,44.0,45.9
1348,\n 1001-1200\n ...,NaN,Yerevan State University,Armenia,8.7,3.0,1.9,64.8,6.0,90.0,8.7,13.3,21.2
1349,\n 1001-1200\n ...,NaN,Yokohama City University,Japan,3.3,6.0,19.0,96.7,3.7,3.5,7.2,14.5,15.0

# Rank dagi qiymatni togirlaymiz

In [6]:
df['Rank'] = df['Rank'].str.strip()

In [7]:
df['Rank']

0               1
1               2
2               3
3               4
4               5
          ...
1345    1001-1200
1346    1001-1200
1347    1001-1200
1348    1001-1200
1349    1001-1200
Name: Rank, Length: 1350, dtype: str

# Score da yoq qiymatlarni Acedemik Reputation ga asoslanib toldirish

In [8]:
import numpy as np

score_col = 'Score'
rank_col = 'Acedemik Reputation'


valid_data = df.dropna(subset=[score_col, rank_col])

x_valid = valid_data[rank_col]
y_valid = valid_data[score_col]


trend_modeli = np.polyfit(x_valid, y_valid, 1)
hisoblash_formulasi = np.poly1d(trend_modeli)

# Score da NaN bo'lgan qatorlar
nan_indekslar = df[score_col].isnull()

df.loc[nan_indekslar, score_col] = hisoblash_formulasi(df.loc[nan_indekslar, rank_col])


print(df[[rank_col, score_col]])

      Acedemik Reputation       Score
0                   100.0  100.000000
1                    99.6   99.400000
2                   100.0   98.900000
3                   100.0   97.900000
4                   100.0   97.700000
...                   ...         ...
1345                  8.0   25.066551
1346                  6.4   24.021147
1347                  5.9   23.694458
1348                  8.7   25.523915
1349                  3.3   21.995677

[1350 rows x 2 columns]

In [9]:
df.tail()

,Rank,Score,Name,Location,Acedemik Reputation,Students,Citations_per_faculty,faculty_student_ratio,employer_reputation,employment_outcomes,international_faculty_ratio,sustainability_score,international_research_network
1345,1001-1200,25.066551,Warsaw University of Life Sciences SGGW (WULS...,Poland,8.0,11.9,14.6,23.1,7.9,7.1,2.4,42.6,67.5
1346,1001-1200,24.021147,West Virginia University,United States,6.4,8.8,28.4,15.0,7.5,21.4,8.3,44.6,66.9
1347,1001-1200,23.694458,Xi'an Jiaotong Liverpool University,China (Mainland),5.9,5.2,12.0,8.1,5.4,1.3,95.2,44.0,45.9
1348,1001-1200,25.523915,Yerevan State University,Armenia,8.7,3.0,1.9,64.8,6.0,90.0,8.7,13.3,21.2
1349,1001-1200,21.995677,Yokohama City University,Japan,3.3,6.0,19.0,96.7,3.7,3.5,7.2,14.5,15.0

In [10]:
df['Score'] = df['Score'].round(1)

In [31]:
df.sample(3)

,Rank,Score,Name,Location,Acedemik Reputation,Students,Citations_per_faculty,faculty_student_ratio,employer_reputation,employment_outcomes,international_faculty_ratio,sustainability_score,international_research_network,Score_class
277,128,64.9,Sapienza University of Rome,Italy,90.7,14.8,62.9,7.8,66.4,91.5,4.0,81.9,95.9,great
917,761-770,28.3,Jamia Millia Islamia,India,13.0,10.7,47.7,40.1,5.6,6.3,4.2,49.7,60.5,good
1064,901-950,28.1,Jouf University,Saudi Arabia,12.6,3.2,7.0,44.8,9.8,2.9,99.2,23.7,56.9,good

# Universitet Score ga kora 5 qismga bolindi -> Multi-class Classification uchun

In [29]:

chegara = [0, 35, 55, 70, 82, 100]

toifa = ['good', 'very good', 'great', 'really great', 'best']

#  kesish
df['Score_class'] = pd.cut(df['Score'], bins=chegara, labels=toifa)

df.head()

,Rank,Score,Name,Location,Acedemik Reputation,Students,Citations_per_faculty,faculty_student_ratio,employer_reputation,employment_outcomes,international_faculty_ratio,sustainability_score,international_research_network,Score_class
0,1,100.0,Massachusetts Institute of Technology (MIT),United States,100.0,91.6,100.0,100.0,100.0,100.0,100.0,93.8,94.1,best
1,2,99.4,Imperial College London,United Kingdom,99.6,100.0,95.0,99.3,100.0,95.9,100.0,98.3,97.5,best
2,3,98.9,Stanford University,United States,100.0,73.5,99.7,100.0,100.0,100.0,94.2,95.4,96.5,best
3,4,97.9,University of Oxford,United Kingdom,100.0,98.6,91.0,100.0,100.0,100.0,98.8,77.9,100.0,best
4,5,97.7,Harvard University,United States,100.0,81.4,100.0,98.3,100.0,100.0,79.1,77.8,99.4,best

In [32]:
df['Score_class'].value_counts()

Score_class
good            720
very good       275
great           165
best            104
really great     86
Name: count, dtype: int64

In [33]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 1350 entries, 0 to 1349
Data columns (total 14 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Rank                            1350 non-null   str
 1   Score                           1350 non-null   float64
 2   Name                            1350 non-null   str
 3   Location                        1349 non-null   str
 4   Acedemik Reputation             1350 non-null   float64
 5   Students                        1328 non-null   float64
 6   Citations_per_faculty           1350 non-null   float64
 7   faculty_student_ratio           1350 non-null   float64
 8   employer_reputation             1350 non-null   float64
 9   employment_outcomes             1350 non-null   float64
 10  international_faculty_ratio     1294 non-null   float64
 11  sustainability_score            1335 non-null   float64
 12  international_research_network  1348 non-null   float64
 13  Score_class                     1350 non-null   category
dtypes: category(1), float64(10), str(3)
memory usage: 138.8 KB

In [34]:
df2 = df.dropna()

In [36]:
df2.info()

<class 'pandas.DataFrame'>
Index: 1279 entries, 0 to 1349
Data columns (total 14 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Rank                            1279 non-null   str
 1   Score                           1279 non-null   float64
 2   Name                            1279 non-null   str
 3   Location                        1279 non-null   str
 4   Acedemik Reputation             1279 non-null   float64
 5   Students                        1279 non-null   float64
 6   Citations_per_faculty           1279 non-null   float64
 7   faculty_student_ratio           1279 non-null   float64
 8   employer_reputation             1279 non-null   float64
 9   employment_outcomes             1279 non-null   float64
 10  international_faculty_ratio     1279 non-null   float64
 11  sustainability_score            1279 non-null   float64
 12  international_research_network  1279 non-null   float64
 13  Score_class                     1279 non-null   category
dtypes: category(1), float64(10), str(3)
memory usage: 141.3 KB

# df ni kerakli joyga saqlab qoyamiz

In [ ]:
import os
path = r'C:\Users\bunyo\OneDrive\Desktop\AI_Course\ModularProgramProjects\first_week_project\data\raw_data'
os.makedirs(path, exist_ok=True)
#full_path = os.path.join(path, 'half_preparedd_data')

df2.to_csv(path + r'\half_prepared_data.csv', index=False, encoding='utf-8')